name = ['佛冈','东风','阿莎','赛罗']  #作为键的列表
sign_person = ['水瓶座','射手座','双鱼座','双子座'] #作为值的列表
person_dict = dict(zip(name,sign_person)) #转换为个人字典
sign_all=['白羊座','金牛座','双子座','巨蟹座','狮子座','处女座',
          '天秤座','天蝎座','射手座','摩羯座','水平座','双鱼座']

nature = ['按实际大富科技阿什顿飞机看了开始减肥加上了附近拉开始的放假了空间按',
          '爱上的很快就啊阿莎看绝代风华卡机是的合法卡戴珊方法将',
          '按实际得分奥兰多市解放路喀什阿莎看砥砺奋进卡洛斯京东方拉斯柯达',
          '啊是的积分加手机端覅偶解放首付款捡垃圾卡视角分开',
          '拉世纪东方捡垃圾司法局阿里家健身房垃圾啊按揭房垃圾啊拉克丝江东父老',
          '阿萨德回复和安徽省开发和卡机是东方航空加思考的积分。']

sign_dict = dict(zip(sign_all,nature)) #转换为星座字典

print("【阿莎】的星座是",person_dict.get("阿莎")) #输出星座
print("\n她的性格特点是：\n\n",sign_dict.get(person_dict.get("阿莎"))) #输出性格特点
