set1 = {'水瓶座','射手座','双鱼座','双子座'}
set2 = {3,2,5,8,7,1,2,6,5}
set3 = {'python',28,('人生苦短，我用python')}
print('asd',set1,'\n')
print('奥',set3)

print('----------------------------------=--------------------======-=')
python = set(['水瓶座','射手座','双鱼座','双子座'])
print('斯柯',python,'\n')

print('----------------------------------=--------------------======-=')
set11 = set('卡拉是加法奥斯卡大家，暗示健康')
set21 = set([3,2,5,8,7,1,2,6,5])
set31 = set(('python',28,('人生苦短，我用python')))
print(set11,'\n',set21,'\n',set31)

print('----------------------------------=--------------------======-=')
mr = set(['水瓶座','射手座','双鱼座','双子座'])
mr.add('加速度')
print(mr)
print('----------------------------------=--------------------======-=')
